# Урок 4. Работа с данными (NumPy и Pandas)
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sys
sys.stdout.reconfigure(encoding='utf-8')
# ==============================
# Задание 1: NumPy
# Создай массив из чисел [10, 20, 30, 40, 50]
# Выполни: среднее, максимум, минимум
# Умножь все числа на 3
# ==============================
numbers = np.array([10, 20, 30, 40, 50])
print("Умнложение на 3:", numbers * 3)
print("Среднее:", numbers.mean())
print("Максимум:", numbers.max())
print("Минимум:", numbers.min())

# ==============================
# Задание 2: Pandas
# Создай таблицу с тремя колонками:
# - Названия 5 любимых фильмов
# - Год выхода
# - Оценка (1–10)
# Выведи среднюю оценку
# ==============================
movies_data = {
    "Название": ["Фильм1", "Фильм2", "Фильм3", "Фильм4", "Фильм5"],
    "Год выхода": [2001, 2005, 2010, 2015, 2020],
    "Оценка": [8, 7.5, 9, 6.5, 8.5]
}

df = pd.DataFrame(movies_data)

print(df)
print("Средняя оценка:", df["Оценка"].mean())


# ==============================
# Задание 3: Визуализация
# Построй график оценок фильмов с помощью matplotlib
# ==============================
# Пример:
df.plot(x="Название", y="Оценка", kind="bar", title="Оценки фильмов", legend=False)
plt.ylabel("Оценка")
plt.show()

